export type LandingLiType = {
	title: string
	description: string
}

export const advs: LandingLiType[] = [
	{
		title: "Усиленная <i>безопасность</i> учебного заведения",
		description:
			"Благодаря системе электронных пропусков заведение сможет контролировать, кто посещает её территорию, что позволит предотвратить несанкционированный вход, повышая безопасность учеников и персонала."
	},
	{
		title: "Эффективность <i>контроля</i> посещения",
		description:
			"Система автоматически записывает время посещения школы учеником, что позволяет отслеживать посещаемость и опоздания без необходимости ручного ведения учета."
	},
	{
		title: "<i>Отчетность</i> и аналитика",
		description:
			"Система может предоставлять данные о посещаемости учебного заведения, которую можно отслеживать с помощью графиков и таблиц."
	},
	{
		title: "Минимализация бумажной работы и <i>экологичность</i>",
		description:
			"Уменьшение использования бумажных пропусков и других документов не только упрощает административные процессы, но и способствует снижению вреда окружающей среды."
	},
	{
		title: "Возможность <i>улучшений</i>",
		description:
			"Открытый исходный код позволит доработать систему под нужды и технические возможности заведения. При создании системы использовались популярные языки программирования и фреймворки, что значительно облегчает дальнейшую модернизацию и поддержку."
	}
]

export const techs: LandingLiType[] = [
	{
		title: "Arduino",
		description:
			"Считывающее устройство состоит из платы Arduino Nano и модуля PN532."
	},
	{
		title: "Python",
		description:
			"Компьютерное приложение для взаимодействия с считывающими устройствами написано на Python."
	},

	{
		title: "Node.js",
		description: "Серверная часть системы написана на Node.js."
	},
	{
		title: "MongoDB",
		description:
			"В качестве базы данных используется MongoDB, а для её администрирования - MongoDB Compass + Shell."
	},
	{
		title: "HTML CSS JavaScript",
		description:
			"Используются в создании сайта проекта, интерфейса компьютерного приложения, а так же сервера. "
	},
	{
		title: "Next.js",
		description: "На нём написан сайт проекта."
	},
	{
		title: "Kotlin",
		description: "Используется в мобильном приложении."
	}
]

export const materials = [
	{
		title: "PC",
		description:
			"Приложение для Windows, которое позволит взаимодействовать со считывающими устройствами.",
		modDesc:
			"Содержит:<br><i>&quot;DL_Guard.exe&quot;</i> - компьютерное приложение.<br><i>&quot;config.json&quot;</i> - файл, куда сохраняется информация об устройствах и настройки.<hr>Приложение считывает информацию с устройств,<br>делает запрос на сервер и выводит результат.",
		path: "/dl-guard.zip"
	},
	{
		title: "Host",
		description: "Файлы программной части сервера системы.",
		modDesc:
			"Содержит:<br><i>&quot;index.js&quot;</i> - файл с готовой логикой сервера на node.js + express.<br><i>&quot;package.json&quot;</i> - файл зависимостей node.js.<br><i>&quot;views/stat.hbs&quot;</i> - шаблон страницы для серверного рендеринга.<br><i>&quot;public/stat.css&quot;</i> - файл стилей для шаблона страницы.<hr>Сервер получает уникальный номер пропуска от приложения &quot;DL Guard | <i>PC</i>&quot;,<br>делает запрос к базе данных, проверяя, есть ли такой в списке разрешенных, и отправляет ответ обратно на устройство.",
		path: "/server_files.zip"
	},
	{
		title: "Device",
		description: "Схемы и скетч считывающего устройства.",
		modDesc:
			"Содержит:<br><i>&quot;card-reader.ino&quot;</i> - готовый скетч для считывающего устройства на Arduino.<hr>Устройство считывает уникальный идентификатор пропуска и выводит его в серийный порт, где его считывает приложение &quot;DL Guard | <i>PC</i>&quot;.",
		path: "/card_reader.zip"
	},
	{
		title: "Mobile",
		description:
			"Приложение для Android, которое позволит пользоваться пропуском с телефона при помощи NFC.",
		modDesc: "В данный момент ещё находится разработке...",
		path: ""
	}
]
